app/views/foods/calculator.html.erb

<script>
jQuery('.food-item').on('click', function() {
	jQuery(this).toggleClass('test');
	var price = jQuery(this).find('span').html();
	if(jQuery(this).hasClass('test')) {
		jQuery(this).find('.hidden').val(price);
	}	else {
		jQuery(this).find('.hidden').val('');
	}

});
---
SELECT "foods".* FROM "foods"