app/views/foods/edit.html.erb

SELECT "categories".* FROM "categories"
---
		<div class="form-group">
			<%= f.select :category_id, Category.all.collect {|x| [x.name, x.id]}, {:include_blank => 'Select One'},class:'form-control' %>