app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Food Cat"], ["created_at", "2018-07-23 18:04:52.429408"], ["updated_at", "2018-07-23 18:04:52.429408"]]
---
  def create
    @category = Category.new(category_params)
    @category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Entreee"], ["updated_at", "2018-07-25 19:40:25.517093"], ["id", 1]]
---
  def update
    @category = Category.find(params[:id])
    @category.update(category_params)

SELECT "categories".* FROM "categories"
---
  def show
    @categories = Category.all