app/controllers/foods_controller.rb

  def create
    @food = Food.new(food_params)
    @food.save
---
INSERT INTO "foods" ("name", "category_id", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Burgers"], ["category_id", 1], ["price", 5.95], ["created_at", "2018-07-23 20:02:10.240458"], ["updated_at", "2018-07-23 20:02:10.240458"]]

  def index
    @foods = Food.all
    @categories = Category.all
---
SELECT "foods".* FROM "foods"
SELECT "categories".* FROM "categories"

  def show
    @categories = Category.all
    @food = Food.new
    @foods = Food.all
---
SELECT "categories".* FROM "categories"
SELECT "foods".* FROM "foods"

  def update
    @food = Food.find(params[:id])
    @food.update(food_params)
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "foods" SET "price" = ?, "updated_at" = ? WHERE "foods"."id" = ?  [["price", 1.95], ["updated_at", "2018-07-24 20:02:37.353338"], ["id", 3]]

  def edit
    @food = Food.find(params[:id])
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def calculator
    @foods = Food.all
    @categories = Category.all
---
SELECT "foods".* FROM "foods"
SELECT "categories".* FROM "categories"